/** @file
 * Содержит описание типа LOGGER и набор операций над ним.
 * Тип предназначен для сбора и хранения информации о процессе загрузки.
 */
#include <Uefi.h>
#include <Library/LogEvent.h>
#include <Library/VectorLib.h>

#ifndef LOGGER_LIB_H_
#define LOGGER_LIB_H_

// -----------------------------------------------------------------------------
typedef struct {
  VECTOR LogData;   // тип = LOG_ENTRY
  // EVENT_PROVIDER EventProvider;
} LOGGER;

// -----------------------------------------------------------------------------
/**
 * Инициализирует структуру LOGGER.
 * Функция должна быть обязательно однократно вызвана перед использованием объекта.
 *
 * @param This                      Указатель на структуру логгера.
 *
 * @retval EFI_SUCCESS              Операция завершена успешно.
 * @retval Любое другое значение    Произошла ошибка, объект не инициализирован.
 */
EFI_STATUS
Logger_Construct (
  LOGGER *This
  );

// -----------------------------------------------------------------------------
VOID
Logger_Destruct (
  LOGGER *This
  );

// -----------------------------------------------------------------------------
EFI_STATUS
Logger_Start (
  LOGGER *This
  );

// -----------------------------------------------------------------------------
VOID
Logger_Stop (
  LOGGER *This
  );

// -----------------------------------------------------------------------------

#endif // LOGGER_LIB_H_