#include <Uefi.h>

#ifndef TEXT_ANIMATION_H_
#define TEXT_ANIMATION_H_

//------------------------------------------------------------------------------
/**
 * Начинает проигрывать анимацию.
*/
VOID
StartPlayingAnimation ();

//------------------------------------------------------------------------------
/**
 * Прекращает проигрывать анимацию, если она проигрывается в данный момент.
*/
VOID
StopPlayingAnimation ();

//------------------------------------------------------------------------------
/**
 * Перерисовывает анимацию.
*/
VOID
UpdatePlayingAnimation();

//------------------------------------------------------------------------------

#endif  // TEXT_ANIMATION_H_